spec/mockery2/app/controllers/users_controller.rb

  def account
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)